###############################################################################
# Brewfile
#
# DESCRIPTION
#   Declarative interface for installing/upgrading packages with Homebrew.
#   This file was created using a combination of `brew bundle dump` and
#   `brew leaves`.
#   See: https://docs.brew.sh/Brew-Bundle-and-Brewfile
#
# INSTALLATION
#   brew bundle check || brew bundle install
###############################################################################

tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"

brew "awscli"
brew "bash"
brew "bzip2"
brew "cmake"
brew "curl"
brew "ffmpeg@4"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "hatch"
brew "helm"
brew "httpie"
brew "hugo"
brew "jenv"
brew "jq"
brew "k9s"
brew "kind"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mas"
brew "minikube"
brew "mpv"
brew "nginx"
brew "nmap"
brew "node"
brew "numpy"
brew "nvm"
brew "openjdk"
brew "openjdk@11"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "rbenv"
brew "ripgrep"
brew "shellcheck"
brew "telnet"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vault"
brew "vim"
brew "yamllint"
brew "youtube-dl"
brew "zlib"

mas "Bear", id: 1091189122
mas "Fantastical", id: 975937182
mas "Gifox", id: 1461845568
mas "Todoist", id: 585829637
