# Homebrew Bundle
#
# See the documentation:
#   * https://github.com/Homebrew/homebrew-bundle
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# This list is generated using `brew leaves`.
brew "bzip2"
brew "cmake"
brew "coreutils"
brew "curl"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grep"
brew "httpie"
brew "hugo"
brew "java"
brew "java11"
brew "jenv"
brew "jq"
brew "k9s"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mas"
brew "minikube"
brew "mpv"
brew "nginx"
brew "nmap"
brew "node"
brew "nvm"
brew "openjdk"
brew "pipenv"
brew "postgresql"
brew "pyenv"
brew "pyenv-virtualenvwrapper"
brew "rbenv"
brew "shellcheck"
brew "tcptraceroute"
brew "telnet"
brew "tfenv"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "youtube-dl"
brew "zlib"

# This list is generated using `mas list`.
mas "Bear", id: 1091189122
mas "Fantastical", id: 975937182
mas "Gifox", id: 1461845568
mas "Instapaper", id: 288545208
mas "LastPass", id: 926036361
mas "Reeder", id: 1529448980
mas "Todoist", id: 585829637
