###############################################################################
# Brewfile (Homebrew Packages)
#
# DESCRIPTION
#   Brewfile for Homebrew.
#
#   Homebrew is a package manager for macOS and Linux that makes it easy to
#   install, manage, and update software from the command line.
#
#   See: https://brew.sh
#
#   A Brewfile is a declarative interface for installing/upgrading packages
#   with Homebrew. This file was created using a combination of `brew bundle
#   dump` and `brew leaves`.
#
#   See: https://docs.brew.sh/Brew-Bundle-and-Brewfile
#
# INSTALLATION
#   Install via Homebrew:
#
#     brew bundle check || brew bundle install
###############################################################################

tap "derailed/k9s"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "oven-sh/bun"

brew "awscli"
brew "bash"
brew "bat"
brew "bun"
brew "bzip2"
brew "cmake"
brew "curl"
brew "felixkratz/formulae/borders"
brew "ffmpeg@4"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "hatch"
brew "helm"
brew "httpie"
brew "hugo"
brew "jq"
brew "k9s"
brew "kind"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mas"
brew "minikube"
brew "mpv"
brew "nginx"
brew "nmap"
brew "node"
brew "numpy"
brew "nvm"
brew "openjdk"
brew "openjdk@11"
brew "perl"
brew "pipx"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "telnet"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vale"
brew "vim"
brew "yamllint"
brew "yt-dlp"
brew "zlib"
brew "zoxide"

cask "alfred"
cask "docker-desktop"
cask "firefox"
cask "gcloud-cli"
cask "gimp"
cask "iterm2"
cask "notion"
cask "obsidian"
cask "slack"

mas "Bear", id: 1091189122
mas "Fantastical", id: 975937182
mas "Gifox", id: 1461845568
mas "Todoist", id: 585829637
